# Groupby 
Illustration of groupby method in Pandas

In [3]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [6]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [7]:
byCompany = df.groupby('Company')

In [8]:
byCompany.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [9]:
byCompany.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

to get the sum of sales of only FB

In [19]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

OR

In [18]:
df.groupby('Company').sum().transpose()['FB']

Sales    593
Name: FB, dtype: int64

In [13]:
df.groupby('Company').describe()

                    Sales
Company
FB      count    2.000000
        mean   296.500000
        std     75.660426
        min    243.000000
        25%    269.750000
        50%    296.500000
        75%    323.250000
        max    350.000000
GOOG    count    2.000000
        mean   160.000000
        std     56.568542
        min    120.000000
        25%    140.000000
        50%    160.000000
        75%    180.000000
        max    200.000000
MSFT    count    2.000000
        mean   232.000000
        std    152.735065
        min    124.000000
        25%    178.000000
        50%    232.000000
        75%    286.000000
        max    340.000000

In [14]:
df.groupby('Company').describe().transpose()

Company    FB                                                     GOOG       \
        count   mean        std  min     25%    50%     75%  max count mean
Sales       2  296.5  75.660426  243  269.75  296.5  323.25  350     2  160

Company ...             MSFT
        ...   75%  max count mean         std  min  25%  50%  75%  max
Sales   ...   180  200     2  232  152.735065  124  178  232  286  340

[1 rows x 24 columns]

In [15]:
df.groupby('Company').describe().transpose()['GOOG']

       count  mean        std  min  25%  50%  75%  max
Sales      2   160  56.568542  120  140  160  180  200